Ran Plan for project: `2` dir: `terraform/stacks/stackkit-test-dev-ap-northeast-2` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=ap-northeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # null_resource.atlantis_test will be created
+ resource "null_resource" "atlantis_test" {
      + id       = (known after apply)
      + triggers = {
          + "timestamp" = (known after apply)
        }
    }

  # module.test_bucket.aws_s3_bucket.main will be created
+ resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + tags_all                    = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.test_bucket.aws_s3_bucket_lifecycle_configuration.main[0] will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "logs_lifecycle"
          + status = "Enabled"

          + filter {
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_public_access_block.main will be created
+ resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_bucket.aws_s3_bucket_server_side_encryption_configuration.main will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_versioning.main will be created
+ resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.vpc.aws_internet_gateway.main will be created
+ resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + tags_all = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-rt-1"
          + "Project"     = "stackkit-test"
        }
      + tags_all         = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-rt-1"
          + "Project"     = "stackkit-test"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + tags_all         = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.default will be created
+ resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "stackkit-test-dev-default-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + tags_all               = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
+ resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
      + tags_all                             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
+ public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
    ]
+ stack_name         = "stackkit-test-dev-ap-northeast-2"
+ test_bucket_arn    = (known after apply)
+ test_bucket_name   = "test-logs"
+ vpc_cidr_block     = "10.0.0.0/16"
+ vpc_id             = (known after apply)

✅ Plan succeeded - sending Slack notification
🔍 DEBUG - Plan 파일 분석:
  PLANFILE 경로: /atlantis/repos/ryu-qqq/stackkit-test/2/default/terraform/stacks/stackkit-test-dev-ap-northeast-2/2-default.tfplan
  파일 존재 확인: Yes
  파일 크기: 13.1K
  JSON 변환: 성공
🔍 DEBUG - JSON 구조 분석:
  JSON 파일 크기: 51585 bytes
  JSON 유효성: true
  JSON 파싱: 성공
  JSON 구조 확인:
    - resource_changes: true
    - planned_values: true
    - configuration: true
    - resource_changes 배열 길이: 19
  첫 번째 resource_change 구조 샘플:
    - address
    - change
    - mode
    - name
    - provider_name
    - change.actions: [
  "create"
]
🔍 DEBUG - 다양한 jq 쿼리 테스트:
  🔄 전략 1: Modern Terraform 형식으로 파싱 시도
    원본 쿼리 결과: CREATE=19, UPDATE=0, DELETE=0
    대체 쿼리1 결과: CREATE=19, UPDATE=0, DELETE=0
  🔄 전략 2: 레거시 형식 또는 대체 구조로 파싱 시도
    planned_values 리소스 개수: 1
  🔄 전략 3: Plan 텍스트 출력에서 파싱 시도
  모든 액션 통계:
    - create: 19
  대체 쿼리2 결과: CREATE=19, UPDATE=0, DELETE=0
  최종 선택된 결과: CREATE=19, UPDATE=0, DELETE=0
  리소스 유형 통계: aws_subnet:4,aws_route_table_association:4,aws_route_table:2
  plan_analysis.json 파일 보존 (디버깅용)
🔍 DEBUG - Infracost 환경 확인:
  INFRACOST_API_KEY 존재: Yes (36 chars)
  infracost 바이너리: Found at /atlantis/bin/infracost
  PLANFILE 존재: Yes
  PLANFILE 경로: /atlantis/repos/ryu-qqq/stackkit-test/2/default/terraform/stacks/stackkit-test-dev-ap-northeast-2/2-default.tfplan
  PLANFILE 크기: 13465
💰 Infracost 비용 분석 시작...
📂 Infracost를 위한 plan 준비 중...
  🔄 Plan을 JSON 형식으로 변환 중...
  ✅ Plan JSON 변환 성공: 52.0K
  📁 사용할 입력: /tmp/infracost-plan-1757240118.json
🔧 Infracost 설정 중...
  ⚠️ API 키 파일 설정 실패 (환경변수로 대체)
  이유: Error: mkdir /.config: permission denied
  환경변수 INFRACOST_API_KEY는 설정되어 있으므로 계속 진행
📊 비용 분석 실행 중...
  사용 중인 API 키: ico-lycX0G...
  🔍 디렉토리에서 Terraform 파일 분석 중...
  ✅ 비용 분석 성공
  ⚠️ JSON은 성공했지만 비용 데이터 없음
💬 GitHub 댓글 생성 중...
  ⚠️ Infracost GitHub 댓글 건너뛰기
  이유: Error: could not load input file /tmp/infracost-plan-1757240118.json err: invalid Infracost JSON file version. Supported versions are 0.2 ≤ x ≤ 0.2
✅ 비용 분석 완료: 💰 월간 비용: 0 USD
  🧹 임시 파일 정리 완료
🔍 DEBUG - Plan 분석 변수들:
  CREATE_COUNT=['19']
  UPDATE_COUNT=['0']
  DELETE_COUNT=['0']
  PLANFILE=['/atlantis/repos/ryu-qqq/stackkit-test/2/default/terraform/stacks/stackkit-test-dev-ap-northeast-2/2-default.tfplan']
  정리된 값들 - CREATE:19, UPDATE:0, DELETE:0
  TOTAL_CHANGES=19
📤 Slack 알림 전송 중...
✅ Plan result sent to Slack (성능: 0.345016s, 2bytes)
🤖 AI will analyze Atlantis logs and comment on PR shortly...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p 2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://prod-atlantis-alb-955214135.ap-northeast-2.elb.amazonaws.com/lock?id=ryu-qqq%252Fstackkit-test%252Fterraform%252Fstacks%252Fstackkit-test-dev-ap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p 2`
</details>
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
